# CreateRelatedFileProgressChangedEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CreateRelatedFileProgressChangedEventArgs Properties
CreateRelatedFileProgressChangedEventArgs Class See Also
---
The CreateRelatedFileProgressChangedEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
| CreatingCloudSharedLocal | Indicates if it is creating cloud shared local model. |
| DownloadFinished | Indicates if all data downloads are finished. |
| FinishedSize | The transferred data size, in bytes, since the last time this event was raised.  (Inherited from DataTransferProgressChangedEventArgs.) |
| FullDownload | Indicates if download the full data of the document, which will take longer than subsequent downloads. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |
| Location | Full path of the central model which is to be operated.  (Inherited from WorksharedOperationProgressChangedEventArgs.) |
| Speed | Speed(bytes/second) in this event.  (Inherited from DataTransferProgressChangedEventArgs.) |
| Status | Gets API event status, reflect current operation execution status.  (Inherited from WorksharedOperationProgressChangedEventArgs.) |
| TotalSize | Total expected data size to transfer, in bytes.  (Inherited from DataTransferProgressChangedEventArgs.) |
| TransferMode | Data transfer mode in this event.  (Inherited from DataTransferProgressChangedEventArgs.) |

# See Also
CreateRelatedFileProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace